pkg/wsman/wsmantesting/responses/amt/timesynchronization/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://intel.com/wbem/wscim/1/amt-schema/1/AMT_TimeSynchronizationService"
    xmlns:h="http://schemas.dmtf.org/wbem/wscim/1/common"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>5</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-00000000280B</b:MessageID>
        <c:ResourceURI>http://intel.com/wbem/wscim/1/amt-schema/1/AMT_TimeSynchronizationService</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:AMT_TimeSynchronizationService>
            <g:CreationClassName>AMT_TimeSynchronizationService</g:CreationClassName>
            <g:ElementName>Intel(r) AMT Time Synchronization Service</g:ElementName>
            <g:EnabledState>5</g:EnabledState>
            <g:LocalTimeSyncEnabled>0</g:LocalTimeSyncEnabled>
            <g:Name>Intel(r) AMT Time Synchronization Service</g:Name>
            <g:RequestedState>12</g:RequestedState>
            <g:SystemCreationClassName>CIM_ComputerSystem</g:SystemCreationClassName>
            <g:SystemName>Intel(r) AMT</g:SystemName>
            <g:TimeSource>1</g:TimeSource>
        </g:AMT_TimeSynchronizationService>
    </a:Body>
</a:Envelope>